app/controllers/providers_controller.rb

INSERT INTO "providers" ("address", "country", "created_at", "duns_number", "name", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["address", "woo"], ["country", "123"], ["created_at", "2014-09-06 06:09:00.180441"], ["duns_number", "123"], ["name", "It worked!!!!!"], ["updated_at", "2014-09-06 06:09:00.180441"]]
---
  def create
    @provider = Provider.create(provider_params)

SELECT  "providers".* FROM "providers"  WHERE "providers"."id" = $1 LIMIT 1  [["id", 4]]
---
  def edit
    @provider = Provider.find(params[:id])

SELECT  "providers".* FROM "providers"  WHERE "providers"."id" = $1 LIMIT 1  [["id", 4]]
---
  def show
    @provider = Provider.find(params[:id])

DELETE FROM "providers" WHERE "providers"."id" = $1  [["id", 6]]
---
  def destroy
    Provider.destroy(params[:id])